## Q1

In [1]:
import pandas as pd

1. read_csv()

In [2]:
df = pd.read_csv("https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv")

2. head()

In [3]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

3. Describe

In [5]:
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

4. tail()

In [6]:
df.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

5. Categorical()

In [7]:
pd.Categorical(df["Survived"])

[0, 1, 1, 1, 0, ..., 0, 1, 0, 1, 0]
Length: 891
Categories (2, int64): [0, 1]

## Q2

In [19]:
def custom_index(df):
    new_index = pd.Index(range(1,len(df)*2 ,2))
    df = df.set_index(new_index)
    return df



data= {
    "A":[1,2,3,4,5],
    "B":["a","b","c","d","e"],
    "C":[23.32,56.4,90.5,123.45,78]
}

In [17]:
df = pd.DataFrame(data)
df

   A  B       C
0  1  a   23.32
1  2  b   56.40
2  3  c   90.50
3  4  d  123.45
4  5  e   78.00

In [20]:
new_df = custom_index(df)
new_df

   A  B       C
1  1  a   23.32
3  2  b   56.40
5  3  c   90.50
7  4  d  123.45
9  5  e   78.00

## Q3

In [29]:
def cal_sum(df):
    total = 0
    for i in range(3):
        total += df["Values"][i]
    
    return total

data1 = data= {
    "A":[12,14,16,21,22,25],
    "B":["a","b","c","d","e","f"],
    "C":[23.32,56.4,90.5,123.45,78,100],
    "Values":[10,20,30,40,50,60]
}

df1 = pd.DataFrame(data1)

In [30]:
result = cal_sum(df1)
print(result)

60

## Q4

In [38]:
data2 = {
    "Text":["Vinay","Devendra","Sanu","Bhoj","Hitesh"]
}

In [39]:
df2 = pd.DataFrame(data2)

In [40]:
df2

       Text
0     Vinay
1  Devendra
2      Sanu
3      Bhoj
4    Hitesh

In [55]:
def word_len(df):  
    lst = []
    for i in range(len(df)):
        lst.append(len(df["Text"][i]))
    df["word_count"] = lst
    return df

In [56]:
new_df = word_len(df2)

In [57]:
new_df

       Text  word_count
0     Vinay           5
1  Devendra           8
2      Sanu           4
3      Bhoj           4
4    Hitesh           6

## Q5

DataFrame.size:
1. DataFrame.size is an attribute that returns the total number of elements in the DataFrame.
2. It calculates the size by multiplying the number of rows (length) by the number of columns in the DataFrame.

In [67]:
new_df

       Text  word_count
0     Vinay           5
1  Devendra           8
2      Sanu           4
3      Bhoj           4
4    Hitesh           6

In [68]:
new_df.size

10

DataFrame.shape:
1. DataFrame.shape is an attribute that returns a tuple representing the dimensions of the DataFrame.
2. The tuple contains two values: the number of rows and the number of columns, respectively.

In [69]:
new_df

       Text  word_count
0     Vinay           5
1  Devendra           8
2      Sanu           4
3      Bhoj           4
4    Hitesh           6

In [70]:
new_df.shape

(5, 2)

## Q6

read_excel is the function that is used to read an excel file.

##  Q7

In [75]:
def Extract_username(df):
    Username = []
    for i in df["email_id"]:
        Username.append(i.split("@")[0])
                        
    df["Username"] = Username
    return df                    
        

data2 = {
    "email_id":["JohnDoe@domain.com","VinayRao@domain.com","BhojNarayan@domain.com","PraveenMishra@domain.com","DevendraRathore@domain.com"]
}
df = pd.DataFrame(data2)
new_df = Extract_username(df)

In [76]:
new_df

                     email_id         Username
0          JohnDoe@domain.com          JohnDoe
1         VinayRao@domain.com         VinayRao
2      BhojNarayan@domain.com      BhojNarayan
3    PraveenMishra@domain.com    PraveenMishra
4  DevendraRathore@domain.com  DevendraRathore

## Q8

In [77]:
data2 = {
    "A": [3,8,6,2,9],
    "B":[5,2,9,3,1],
    "C":[1,7,4,5,2]
}

In [78]:
df3 = pd.DataFrame(data2)

In [79]:
df3

   A  B  C
0  3  5  1
1  8  2  7
2  6  9  4
3  2  3  5
4  9  1  2

In [84]:
def extract_DataFrame(df):
    df1 = df[df["A"]>5]
    df2 = df1[df1["B"] < 9]
    return df2

In [85]:
extracted_df = extract_DataFrame(df3)

In [86]:
extracted_df

   A  B  C
1  8  2  7
4  9  1  2

## Q9

In [104]:
df4

   Values
0      10
1      20
2      30
3      40
4      50
5      60

In [103]:
def stats(df):
    values_column = df["Values"]
    mean = values_column.mean()
    median = values_column.median()
    std_dev = values_column.std()
    
    return mean,median,std_dev

data4 = {
    "Values" : [10,20,30,40,50,60]
}
df4 = pd.DataFrame(data4)
mean_value,median_value,std_dev_value = stats(df4)

print("Mean of those values: ",mean_value)
print("Median of those values: ",median_value)
print("standard deviation of those values: ",std_dev_value)

Mean of those values:  35.0
Median of those values:  35.0
standard deviation of those values:  18.708286933869708

## Q10

In [112]:
import pandas as pd

def calculate_moving_average(df):
    
    df['Date'] = pd.to_datetime(df['Date'])
    df = df.sort_values(by='Date')
    
    # Calculate the moving average with a window size of 7 days
    df['MovingAverage'] = df['Sales'].rolling(window=7, min_periods=1).mean()
    
    return df


data = {'Sales': [100, 150, 200, 120, 180, 210, 250, 220, 190, 230],
        'Date': ['2023-08-01', '2023-08-02', '2023-08-03', '2023-08-04', '2023-08-05',
                 '2023-08-06', '2023-08-07', '2023-08-08', '2023-08-09', '2023-08-10']}

df = pd.DataFrame(data)


df = calculate_moving_average(df)


print(df)

   Sales       Date  MovingAverage
0    100 2023-08-01     100.000000
1    150 2023-08-02     125.000000
2    200 2023-08-03     150.000000
3    120 2023-08-04     142.500000
4    180 2023-08-05     150.000000
5    210 2023-08-06     160.000000
6    250 2023-08-07     172.857143
7    220 2023-08-08     190.000000
8    190 2023-08-09     195.714286
9    230 2023-08-10     200.000000

## Q11

In [113]:
def weekday_fun(df):
    df['Date'] = pd.to_datetime(df['Date'])
    df = df.sort_values(by='Date')
    
    df['Weekday'] = df['Date'].dt.day_name()
    return df

data5 = {
    "Date" : ['2023-01-01','2023-01-02','2023-01-03','2023-01-04','2023-01-05']
}
df5 = pd.DataFrame(data5)
new_df = weekday_fun(df5)

In [114]:
new_df

        Date    Weekday
0 2023-01-01     Sunday
1 2023-01-02     Monday
2 2023-01-03    Tuesday
3 2023-01-04  Wednesday
4 2023-01-05   Thursday

## Q12

In [125]:
import pandas as pd

def select_rows_between_dates(df, start_date, end_date):
    
    df['Date'] = pd.to_datetime(df['Date'])
    
    
    selected_rows = df[(df['Date'] >= start_date) & (df['Date'] <= end_date)]
    
    return selected_rows


data = {'Date': ['2023-01-05', '2023-01-15', '2023-02-10', '2023-03-20']}
df = pd.DataFrame(data)


start_date = pd.to_datetime('2023-01-01')
end_date = pd.to_datetime('2023-01-31')


selected_rows = select_rows_between_dates(df, start_date, end_date)

In [124]:
selected_rows

        Date
0 2023-01-05
1 2023-01-15

## Q13

import pandas as pd

It is the first and foremost necessary library that needs to be imported.